// 1129.c
// 运算符
// 函数名， 参数列表， 函数体， 返回值
#include <stdio.h>
// 宏定义：宏名称 值（字面量，字符串）
#define PI 3.1415926
// #define PI = 3.1415926       //错误
// #define PI = 3.1415926;      //错误

#define DIV         32.0
#define FACTOR      (5.0 / 9.0)

int main()
{
    // ---------------------------------------输入
    // print, scan

    // 模10除10 从低位开始
    int n = 345;
    int n1, n10, n100;

    n1 = n % 10;
    n /= 10;

    n10 = n % 10;
    n /= 10;

    n100 = n % 10;
    n /= 10;

    /*
    // 提示用户输入华氏度，输出摄氏度
    // c = (f - 32.0) * 5 / 9;
    double f;   //华氏度
    double c;   //摄氏度
    printf("请输入华氏度：");
    // 格式化读取
    // & 取地址符，获取 f 所在内存地址
    // %d, %f, %o
    scanf("%lf", &f);

    // 避免神秘数字
    // 1. 常量， 2. 宏（常量、字符替换）
    c = (f - DIV) * FACTOR;

    printf("%10.2lf\n%10.2lf\n", f, c);
    */

    // ------------------------------------- 算术运算
    /*
    int a = 2 / 3;      // 0                0 0000000000000000000000000000000 31
    float b = 2.f / 3;    // 0.000000         0 00000000 00000000000000000000000 23
    printf("%d, %f\n", a, b);

    // 模运算: 整数，不能浮点数
    printf("%d\n", 7 / 4);  // 1
    printf("%d\n", 7 % 4);  // 3, 0~3

    a = a + 3;
    a += 3;

    // 计数器
    a++;        // a = a + 1, a += 1
    ++a;

    a = 4;
    int b1 = a++;       // 后缀自增：先运算后自增
    printf("%d, %d\n", a, b1);      // 5,4

    a = 4;
    int b2 = ++a;       // 前缀自增：先自增后运算
    printf("%d, %d\n", a, b2);      // 5,5

    int x = 1, y = 2;
    int z = ++x + y++;
    printf("%d, %d, %d\n", x, y, z);    // 2,3,4

    x = 2;
    z = ++x + x++;                  // 未定义行为，不同编译器结果不同
    printf("%d, %d\n", x, z);       // 4,7
    */

    // ------------------------------------- ctrl + /
    // // 声明（空间分配）、 赋值、 初始化
    // int a;
    // a = 9;      // 字面量
    // a = 2 + 3;  // 表达式   5
    // a = a - 1;  // 
    // // a = max(2, 3);   // 函数

    // int x = 1, y = 3, z = 9;
    // x = y = z = 1;  // 先赋给z，再赋给y，最后赋给x
    // x = y + 1, y = 3;   //逗号运算: 先执行“，”左边的，再执行右边的    2,3
    // printf("%d, %d\n", x, y);

    return 0;
}